import { FundInfo } from './interfaces/fund'

export const FundInfoMap = new Map<string, FundInfo>([
  [
    '农银新能源主题',
    {
      code: '002190',
      subject: ['锂电池', '特斯拉', '电源设备'],
    },
  ],
  [
    '鹏华医药科技',
    {
      code: '001230',
      subject: ['医疗服务', '创新药'],
    },
  ],
  [
    '国泰国证有色金属行业指数',
    {
      code: '160221',
      subject: ['稀有金属', '工业金属', '黄金'],
    },
  ],
  [
    '国泰大农业股票',
    {
      code: '001579',
      subject: ['食品饮料', '猪肉产业'],
    },
  ],
  [
    '诺安成长',
    {
      code: '320007',
      subject: ['半导体'],
    },
  ],
  [
    '中银智能制造股票A',
    {
      code: '001476',
      subject: ['电源设备', '光伏'],
    },
  ],
  [
    '招商中证煤炭等权指数',
    {
      code: '161724',
      subject: ['煤炭开采'],
    },
  ],
  [
    '鹏华中证国防指数(LOF)A',
    {
      code: '160630',
      subject: ['航空装备', '军工'],
    },
  ],
  [
    '景顺长城策略精选灵活配置混合',
    {
      code: '000242',
      subject: ['化学制品'],
    },
  ],
  [
    '长信电子信息行业量化灵活配置混合',
    {
      code: '519929',
      subject: ['5G'],
    },
  ],
  [
    '融通中证人工智能主题',
    {
      code: '161631',
      subject: ['计算机应用', '云计算'],
    },
  ],
])
