import { FundInfo } from './interfaces/fund'

export const FundInfoMap = new Map<string, FundInfo>([
  [
    '农银新能源',
    {
      code: '002190',
      subject: ['锂电池', '特斯拉', '电源设备'],
    },
  ],
  [
    '鹏华医药',
    {
      code: '001230',
      subject: ['医疗服务', '创新药'],
    },
  ],
  [
    '国泰国证有色金属',
    {
      code: '160221',
      subject: ['稀有金属', '工业金属', '黄金'],
    },
  ],
  [
    '国泰大农业',
    {
      code: '001579',
      subject: ['食品饮料', '猪肉产业'],
    },
  ],
  [
    '诺安成长',
    {
      code: '320007',
      subject: ['半导体'],
    },
  ],
  [
    '鹏华中证国防',
    {
      code: '160630',
      subject: ['航空装备', '军工'],
    },
  ],
  [
    '景顺长城策略精选',
    {
      code: '000242',
      subject: ['化学制品'],
    },
  ],
  [
    '鹏华国证钢铁',
    {
      code: '502023',
      subject: ['钢铁'],
    },
  ],
  [
    '创金合信科技',
    {
      code: '005495',
      subject: ['OLED', '柔性屏', '光学光电子'],
    },
  ],
  [
    '华商电子',
    {
      code: '007685',
      subject: ['5G', '半导体', '电子制造'],
    },
  ],
  [
    '申万中证申万电子',
    {
      code: '163116',
      subject: ['5G', '电子制造', '半导体'],
    },
  ],
  [
    '融通新能源',
    {
      code: '005668',
      subject: ['特斯拉', '锂电池', '汽车零部件'],
    },
  ],
])
